Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/puheenjohtaja.html.tmx
Source language: fin
Languages: smn

source: Puheenjohtaja
smn: Saavâjođetteijee

source: Tuomas Aslak Juuso eli Gáijjot Ánte Issáha Duommá on syntynyt Lahdessa 7. helmikuuta 1985.
smn: Tuomas Aslak Juuso ađai Gáijjot Ánte Issáha Duommá lii šoddâm Lahtist kuovâmáánu 7. peeivi 1985.

source: Juuso on varttunut sekä Lahdessa että Karesuvannossa, mutta peruskoulun hän on käynyt pääsääntöisesti Lahdessa.
smn: Juuso lii pajasšoddâm sehe Lahtist ete Käresavonist, mutâ vuáđuškoovlâ sun lii jottáám iänááš Lahtist.

source: Juuso on suorittanut poro- ja luontaistalouden ammattitutkinnon Saamelaisalueen koulutuskeskuksessa Kaamasen Toivoniemessä.
smn: Juuso lii čođâldittâm puásui- já luándutuálu áámmáttotkos Säämi máttááttâskuávdáást Kaamâs Tuáivunjaargâst.

source: Lisäksi hän on suorittanut porotalouden lähettilään ohjelman (The Reindeer ambassador program, International Centre for Reindeer Husbandry) sekä kursseja alkuperäiskansaoikeuksista (Sámi University College, Kautokeino).
smn: Toos lasseen sun lii čođâldittâm puásuituálu vuolgâttâsulmuu ohjelm (The Reindeer ambassador program, International Centre for Reindeer Husbandry) sehe kuursâid algâaalmugvuoigâdvuođâst (Sámi University College, Kuovdâkiäinu).

source: Nykyisin Juuso asuu Karesuvannossa.
smn: Tääl Juuso áásá Käresavonist.

source: Juuso valittiin Saamelaiskäräjien jäseneksi ensimmäisen kerran vuonna 2008.
smn: Juuso väljejui Sämitige jesânin vuossâmuu tove ive 2008.

source: Hän on edelleen kaikkien aikojen nuorin Saamelaiskäräjille valittu jäsen.
smn: Sun lii ain nuorâmus Sämitiigán väljejum jeessân miätá aaigij.

source: Juuso valittiin Saamelaiskäräjien 2. varapuheenjohtajaksi vaalikaudelle 2016-2019 ja nyt kolmannelle kaudelleen 2020-2023 Juuso valittiin Saamelaiskäräjien puheenjohtajaksi helmikuussa 2020.
smn: Juuso väljejui Sämitige 2. värisaavâjođetteijen valjâpajan 2016-2019 já tääl suu kuálmád pajan 2020-2023 Juuso väljejui Sämitige saavâjođetteijen kuovâmáánust 2020.

source: Juuso on ollut aktiivisesti mukana saamelaisyhteiskunnan toiminnassa nuoresta lähtien.
smn: Juuso lii lamaš aktiivlávt mieldi sämmilâšohtsâškode tooimâst nuorâvuođâ rääjist.

source: Juuso toimi Suomen Saamelaisnuoret ry:n hallituksen puheenjohtajana vuosina 2005-2007 ja 2009-2012.
smn: Juuso tooimâi Suomâ Sämmilâšnuorah rs. stiivrâ saavâjođetteijen iivijn 2005-2007 já 2009-2012.

source: Lisäksi hän on toiminut Yhdistyneiden kansakuntien (YK) alkuperäiskansojen nuorten liiton (Global Indigenous Youth Caucus) puheenjohtajana vuosina 2012-2015 ja YK:n alkuperäiskansojen maailmankonferessin yhteydessä toimineen alkuperäiskansojen globaalin koordinaatiotyöryhmän jäsenenä 2012-2014.
smn: Lasseen sun lii toimâm Ovtâstum aalmugij (OA) algâaalmugij nuorâi lito (Global Indigenous Youth Caucus) saavâjođetteijen iivijn 2012-2015 já OA algâaalmugij maailmkonferens ohtâvuođâst toimâm algâaalmugij maailmvijđosii koordinistempargojuávhu jesânin 2012-2014.

source: Hän on ollut myös monissa YK:ssa tapahtuneissa neuvotteluprosesseissa mukana, esimerkiksi EMRIP (Expert Mechanism on the Rights of Indigenous Peoples) mandaatin uudistamisneuvottelut, alkuperäiskansojen osallistumisoikeuden vahvistamista YK:ssa koskevat neuvottelut ja YK:n maailmankonferenssin loppudokumentin neuvottelut.
smn: Sun lii lamaš meid maaŋgâin OA:st tábáhtum ráđádâllâmprosesijn mieldi, ovdâmerkkân EMRIP (Expert Mechanism on the Rights of Indigenous Peoples) mandaat uđâsmittemráđádâlmeh, algâaalmugij uásálistemvuoigâdvuotâ OA:n já OA maailmkonferens loppâdokument ráđádâlmeh.

source: Alkuperäiskansojen oikeudet ovat Juusolle tärkeitä ja hän kertookin, että YK:n alkuperäiskansojen julistus on syy siihen, miksi hän lähti ensimmäisiin saamelaiskäräjävaaleihin mukaan.
smn: Algâaalmugij vuoigâdvuođah láá Juuson teháliih já sun muštâl-uv, ete OA algâaalmugij julgáštus lii suijâ toos, mane sun vuolgij vuossâmuid sämitiggevaljáid fáárun.

source: Juuso tulee Kaijukoiden eli Raittijärven siidasta, missä poronhoito perustuu vanhaan siida-järjestelmään.
smn: Juuso puátá Kaijukka ađai Ávžžášjávri siijdâst, mast puásuituálu vuáđđun lii puáris sijdâ-vuáhádâh.

source: Tuomas Aslak Juuso Puheenjohtaja
smn: Tuomas Aslak Juuso Saavâjođetteijee

source: Yhteystiedot
smn: Ohtâvuotâtiäđuh

source: Puheenjohtajan avustaja
smn: Saavâjođetteijee išedeijee
